const delay = (ms) => new Promise(res => setTimeout(res, ms));

const activeMurgi = new Map();

module.exports = {
  config: {
    name: "murgi",
    version: "1.1.0",
    role: 2,
    author: "SagoR",
    description: "Loop bad word messages until stopped",
    category: "fun",
    usages: "@mention | off",
    cooldowns: 5,
  },

  onStart: async function({ message, event, args }) {
    if (args[0] && args[0].toLowerCase() === "off") {
      if (activeMurgi.has(event.threadID)) {
        activeMurgi.set(event.threadID, false);
        return message.reply("🛑");
      } else {
        return message.reply("💔");
      }
    }

    const mention = Object.keys(event.mentions)[0];
    if (!mention) {
      return message.reply("_〲বস খানকির পোলারে মেনশন করুন চোদার দায়িত্ব আমার..!😇");
    }

    const name = event.mentions[mention];
    const arraytag = [{ id: mention, tag: name }];

    const messages = [
      "তোর সাগর Abbu এর চোদা লো",
        "খাংকির পোলা তর মারে চুদি",
        "খাংকির পোলা তর কচি বোন রে আমি সাগর চুদি  😍",
        "মাদারচোদ তর আম্মু পম পম খাংকির পো আমি তোর বাপ SAGOR 🐰",
        "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু i Am তোর আব্বু সাগর 💔",
        "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬",
        "বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟",
        "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  Power OF SaGor BoT🤝",
        "উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉",
        "অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি সাগর তর বাপ মাগির ছেলে 😘",
        "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋",
        "হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি",
        "চুদা কি আরো খাবি মাগির পোল",
        "খাংকির পোলা 🥰",
        "মাদারচোদ😍",
        "ব্যাস্যার পোলা 🐰",
        "ব্যাশ্যা মাগির পোলা  💔",
        "পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর মারে চুদি",
        "তর বোন রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "কামলা মাগির পোলা  ✋",
        "বাস্ট্রাড এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান🤖",
        "Welcome মাগির পোলা 🥰",
        "তর কচি বোন এর পম পম😍",
        "ব্যাস্যার পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰",
        "Hi সাগর এর জারজ মাগির পোলা  💔",
        "২০ টাকা এ পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "বস্তির ছেলে অনলাইনের কিং",
        "টুকাই মাগির পোলা🤟",
        "তর আম্মু রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "হিজলা মাগির পোলা  ✋",
        "বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান জা ভাগ",
        "তোর সাগর Abbu এর চোদা লো",
        "খাংকির পোলা তর মারে চুদি",
        "খাংকির পোলা তর কচি বোন রে আমি সাগর চুদি  😍",
        "মাদারচোদ তর আম্মু পম পম খাংকির পো আমি তোর বাপ SAGOR 🐰",
        "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু i Am তোর আব্বু সাগর 💔",
        "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬",
        "বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟",
        "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  Power OF SaGor BoT🤝",
        "উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉",
        "অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি সাগর তর বাপ মাগির ছেলে 😘",
        "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋",
        "হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি",
        "চুদা কি আরো খাবি মাগির পোল",
        "খাংকির পোলা 🥰",
        "মাদারচোদ😍",
        "ব্যাস্যার পোলা 🐰",
        "ব্যাশ্যা মাগির পোলা  💔",
        "পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর মারে চুদি",
        "তর বোন রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "কামলা মাগির পোলা  ✋",
        "বাস্ট্রাড এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান🤖",
        "Welcome মাগির পোলা 🥰",
        "তর কচি বোন এর পম পম😍",
        "ব্যাস্যার পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰",
        "Hi সাগর এর জারজ মাগির পোলা  💔",
        "২০ টাকা এ পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "বস্তির ছেলে অনলাইনের কিং",
        "টুকাই মাগির পোলা🤟",
        "তর আম্মু রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "হিজলা মাগির পোলা  ✋",
        "বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান জা ভাগ",
        "তোর সাগর Abbu এর চোদা লো",
        "খাংকির পোলা তর মারে চুদি",
        "খাংকির পোলা তর কচি বোন রে আমি সাগর চুদি  😍",
        "মাদারচোদ তর আম্মু পম পম খাংকির পো আমি তোর বাপ SAGOR 🐰",
        "খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু i Am তোর আব্বু সাগর 💔",
        "খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬",
        "বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟",
        "বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  Power OF SaGor BoT🤝",
        "উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉",
        "অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি সাগর তর বাপ মাগির ছেলে 😘",
        "বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋",
        "হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি",
        "চুদা কি আরো খাবি মাগির পোল",
        "খাংকির পোলা 🥰",
        "মাদারচোদ😍",
        "ব্যাস্যার পোলা 🐰",
        "ব্যাশ্যা মাগির পোলা  💔",
        "পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "তর মারে চুদি",
        "তর বোন রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "কামলা মাগির পোলা  ✋",
        "বাস্ট্রাড এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান🤖",
        "Welcome মাগির পোলা 🥰",
        "তর কচি বোন এর পম পম😍",
        "ব্যাস্যার পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰",
        "Hi সাগর এর জারজ মাগির পোলা  💔",
        "২০ টাকা এ পতিতা মাগির পোলা",
        "depression থেকেও তর মাইরে চু*** দি 🤬",
        "বস্তির ছেলে অনলাইনের কিং",
        "টুকাই মাগির পোলা🤟",
        "তর আম্মু রে পায়জামা খুলে চুদি 🤣",
        "উম্মম্মা তর বোন এরকচি ভুদায়💉",
        "DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।",
        "হিজলা মাগির পোলা  ✋",
        "বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা",
        "আমার জারজ শন্তান জা ভাগ",
    ];

    activeMurgi.set(event.threadID, true);
    message.reply("🤗");

    try {
      while (activeMurgi.get(event.threadID)) {
        for (const msg of messages) {
          if (!activeMurgi.get(event.threadID)) break;

          await delay(2500);
          message.reply({
            body: `${msg}\n${name}`,
              mentions: arraytag
          });
        }
      }
    } catch (err) {
      console.error(err);
      activeMurgi.delete(event.threadID);
      message.reply("Something went wrong!");
    }
  }
};
